Декомпозиция задачи:
	Тест на добавление товара с видом "товар"
	Тест на добавление товара с видом "Услуга"
	Добавление картинки и ее присутствие
	Тест с добавлением Характиристики
	Тест без добавления Характиристики
Замеряем среднее всремя на написание одного теста:
	15 минут (Итого 75 минут)
Определение количество ошибок и время работы с одним дефектом 
	1 ошибка 40 минут (Сложность с добавлением картинки)
Закладываем дополнительные затраты и риски
	30 минут
Итого 
	145 минут без заложения на полный прогон ранее написанных тестов
	160 минут с заложением на полный прогон ранее написанных тестов
