1.Платформа 8.3.20.1838
2.файловая база

В документе Заказ(Демо база) при добавлении услуги не доступно поле "Количество". При этом оно учитывается в итоговом количестве по документу.

Шаги воспроизведения:
1. Открываю документ "Заказы товаров"
2. Указываю Организацию ООО "Все для дома", Покупателя Мосхлеб ОАО, склад Строящийся склад.
3. Добавляю товар "Доставка"

Фактический результат:
Поле количество не доступно, но количство учитывается в итоговом количестве по документу

Ожидаемый результат:
Поле количество доступно, количество учитывается в итоговом количестве по документу

Скрины
*Тут скриншот*
